app/controllers/beers_controller.rb

SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 1171], ["LIMIT", 1]]
---
    def show
        beer = Beer.find_by_id params[:id]