app/controllers/beer_questions_controller.rb

INSERT INTO "beer_questions" ("beer_id", "quiz_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["beer_id", 1171], ["quiz_id", 200], ["created_at", "2019-07-12 08:51:23.393779"], ["updated_at", "2019-07-12 08:51:23.393779"]]
---
  def create
    # pull a random beer
    quiz = Quiz.find_by(id: params[:quiz_id])
    beer_question = BeerQuestion.createBeerQuestion(quiz)