app/controllers/horse_questions_controller.rb

  def create
    # pull a random horse
    quiz = Quiz.find_by(id: params[:quiz_id])
    horse_question = HorseQuestion.createHorseQuestion(quiz)
---
INSERT INTO "horse_questions" ("horse_id", "quiz_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["horse_id", 12056], ["quiz_id", 201], ["created_at", "2019-07-12 09:01:43.099139"], ["updated_at", "2019-07-12 09:01:43.099139"]]