app/controllers/horses_controller.rb

    def show
        horse = Horse.find_by_id params[:id]
---
SELECT  "horses".* FROM "horses" WHERE "horses"."id" = $1 LIMIT $2  [["id", 6278], ["LIMIT", 1]]