app/controllers/users_controller.rb

  def create
    @user = User.create user_params
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Sam"], ["created_at", "2019-07-12 08:51:23.228341"], ["updated_at", "2019-07-12 08:51:23.228341"]]

  def find_user
    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]