app/models/beer_question.rb

  def self.createBeerQuestion(quiz)
    random_number = rand(Beer.all.length) + Beer.first.id
    @beer_question = BeerQuestion.create(beer_id: random_number, quiz_id: quiz.id)
---
SELECT  "beers".* FROM "beers" ORDER BY "beers"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "beer_questions" ("beer_id", "quiz_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["beer_id", 1171], ["quiz_id", 200], ["created_at", "2019-07-12 08:51:23.393779"], ["updated_at", "2019-07-12 08:51:23.393779"]]