app/models/horse_question.rb

SELECT  "horses".* FROM "horses" ORDER BY "horses"."id" ASC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "horse_questions" ("horse_id", "quiz_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["horse_id", 6278], ["quiz_id", 200], ["created_at", "2019-07-12 08:51:38.658547"], ["updated_at", "2019-07-12 08:51:38.658547"]]
---
  def self.createHorseQuestion(quiz)
    random_number = rand(Horse.all.length) + Horse.first.id
    @horse_question = HorseQuestion.create(horse_id: random_number, quiz_id: quiz.id)